{
    "type": "conference",
    "title": "'Beating the News' with EMBERS: Forecasting Civil Unrest Using Open Source Indicators",
    "authors": [
        "Naren Ramakrishnan",
        "Patrick Butler",
        "Nathan Self",
        "Rupinder Khandpur",
        "Parang Saraf",
        "Wei Wang",
        "Jose Cadena",
        "Anil Vullikanti",
        "Gizem Korkmaz",
        "Christopher Kuhlman",
        "Achla Marathe",
        "Liang Zhao",
        "Hua Ting",
        "Bert Huang",
        "Aravind Srinivasan",
        "Khoa Trinh",
        "Lise Getoor",
        "Graham Katz",
        "Andy Doyle",
        "Chris Ackermann",
        "Ilya Zavorin",
        "Jim Ford",
        "Kristin Summers",
        "Youssef Fayed",
        "Jaime Arredondo",
        "Dipak Gupta",
        "David Mares"
    ],
    "venue": "International Conference on Knowledge Discovery and Data Mining",
    "year": "2014",
    "publisher": "ACM",
    "address": "New York, NY, USA",
    "links": [
        {
            "label": "paper",
            "href": "/assets/resources/ramakrishnan-kdd14.pdf"
        }
    ],
    "abstract": "We describe the design, implementation, and evaluation of EMBERS, an automated, 24x7 continuous system for forecasting civil unrest across 10 countries of Latin America using open source indicators such as tweets, news sources, blogs, economic indicators, and other data sources. Unlike retrospective studies, EMBERS has been making forecasts into the future since Nov 2012 which have been (and continue to be) evaluated by an independent T&E team (MITRE). Of note, EMBERS has successfully forecast the uptick and downtick of incidents during the June 2013 protests in Brazil. We outline the system architecture of EMBERS, individual models that leverage specific data sources, and a fusion and suppression engine that supports trading off specific evaluation criteria. EMBERS also provides an audit trail interface that enables the investigation of why specific predictions were made along with the data utilized for forecasting. Through numerous evaluations, we demonstrate the superiority of EMBERS over baserate methods and its capability to forecast significant societal happenings."
}
