{
    "type": "phdthesis",
    "title": "A Probabilistic Approach to Modeling Socio-Behavioral Interactions",
    "authors": [
        "Arti Ramesh"
    ],
    "venue": "University of Maryland, College Park",
    "year": "2016",
    "publisher": "UMD",
    "address": "College Park, MD, USA",
    "keywords": [
        "MOOC",
        "Socio-Behavioral Models",
        "Latent Variable Models",
        "Learning Analytics",
        "Structured Prediction"
    ],
    "links": [
        {
            "label": "paper",
            "href": "/assets/resources/ramesh-phd16.pdf"
        }
    ],
    "abstract": "In our ever-increasingly connected world, it is essential to build computational models that represent, reason, and model the underlying characteristics of real-world networks. Data generated from these networks are often heterogeneous, interlinked, and exhibit rich multi-relational graph structures having unobserved latent characteristics. My work focuses on building computational models for representing and reasoning about rich, heterogeneous, interlinked graph data. In my research, I model socio-behavioral interactions and predict user behavior patterns in two important online interaction platforms: online courses and online professional networks. Structured data from these interaction platforms contain rich behavioral and interaction data, and provide an opportunity to design machine learning methods for understanding and interpreting user behavior. The data also contains unstructured data, such as natural language text from forum posts and other online discussions. My research aims at constructing a family of probabilistic models for modeling social interactions involving both structured and unstructured data. In the early part of this thesis, I present a family of probabilistic models for online courses for: 1) modeling student engagement, 2) predicting student completion and dropouts, 3) modeling student sentiment toward various course aspects (e.g., content vs. logistics), 4) detecting coarse and fine-grained course aspects (e.g., grading, video, content), and 5) modeling evolution of topics in repeated offerings of online courses. These methods have the potential to improve student experience and focus limited instructor resources in ways that will have the most impact. In the latter part of this thesis, I present methods to model multi-relational influence in online professional networks. I test the effectiveness of this model via experimentation on the professional network, LinkedIn. My models can potentially be adapted to address a wide range of problems in real-world networks including predicting user interests, user retention, personalization, and making recommendations."
}
